Revit 2026 API

# ElementNodeDocument Property

---

Gets the document associated with the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Document Document { get; }
```
```vb
Public ReadOnly Property Document As Document
	Get
```
```cpp
public:
property Document^ Document {
	Document^ get ();
}
```
```fsharp
member Document : Document with get
```

#### Property Value

Document

The document is in read-only state. Transactions are not allowed in it.

#### Reference

ElementNode Class

Autodesk.Revit.DB Namespace